[
  {
    "bookId": 1,
    "bookName": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "image": "https://m.media-amazon.com/images/I/81CkzCy2mAL._SL1500_.jpg",
    "review": "To Kill a Mockingbird is a classic novel set in the racially charged atmosphere of the American South during the 1930s. Through the eyes of young Scout Finch, readers witness the injustice and prejudice that permeate society. The story explores themes of morality, compassion, and the loss of innocence, as Scout's father, Atticus Finch, defends a black man accused of raping a white woman. Harper Lee's poignant narrative confronts readers with uncomfortable truths about race and class, making it a timeless and thought-provoking read.",
    "totalPages": 336,
    "rating": 4.5,
    "category": "Fiction",
    "tags": ["Classic", "Race Relations", "Legal Drama"],
    "publisher": "J. B. Lippincott & Co.",
    "yearOfPublishing": 1960,
    "price": 310
  },
  {
    "bookId": 2,
    "bookName": "The Picture of Dorian Gray",
    "author": "Oscar Wilde",
    "image": "https://m.media-amazon.com/images/I/91uns-1GnQL._SL1500_.jpg",
    "review": "The Picture of Dorian Gray, penned by Oscar Wilde, is a dark and provocative exploration of vanity, morality, and the pursuit of beauty. The novel tells the story of Dorian Gray, a handsome young man who remains perpetually youthful while a portrait of him ages and bears the marks of his sins. As Dorian indulges in a life of decadence and hedonism, the portrait becomes increasingly grotesque, reflecting the corruption of his soul. Wilde's biting wit and keen observations of human nature make The Picture of Dorian Gray a compelling and thought-provoking read that continues to resonate with readers.",
    "totalPages": 250,
    "rating": 4.5,
    "category": "Gothic Fiction",
    "tags": ["Morality", "Decadence", "Aestheticism"],
    "publisher": "Ward, Lock & Co.",
    "yearOfPublishing": 1890,
    "price": 220
  },
  {
    "bookId": 3,
    "bookName": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "image": "https://m.media-amazon.com/images/I/61dRoDRubtL._SL1500_.jpg",
    "review": "F. Scott Fitzgerald's The Great Gatsby is a compelling portrayal of the American Dream and its disillusionment in the Roaring Twenties. Through the eyes of narrator Nick Carraway, readers are drawn into the lavish and decadent world of Jay Gatsby, a mysterious millionaire who longs to recapture the love of his life, Daisy Buchanan. Set against the backdrop of opulent parties and social upheaval, the novel explores themes of wealth, love, and the emptiness of materialism. Fitzgerald's lyrical prose and vivid characters make The Great Gatsby a timeless classic that continues to captivate readers.",
    "totalPages": 180,
    "rating": 4.4,
    "category": "Fiction",
    "tags": ["American Dream", "Roaring Twenties", "Tragedy"],
    "publisher": "Charles Scribner's Sons",
    "yearOfPublishing": 1925,
    "price": 420
  },
  {
    "bookId": 4,
    "bookName": "Pride and Prejudice",
    "author": "Jane Austen",
    "image": "https://m.media-amazon.com/images/I/51yAW6H79GL._SL1000_.jpg",
    "review": "Pride and Prejudice, written by Jane Austen, is a timeless romantic comedy that continues to enchant readers with its wit and charm. Set in early 19th-century England, the novel follows the spirited Elizabeth Bennet as she navigates the complexities of love, class, and societal expectations. Central to the story is Elizabeth's tumultuous relationship with the enigmatic Mr. Darcy, whose pride and her prejudice initially stand in the way of their happiness. Austen's keen observations of human nature and her sharp social commentary make Pride and Prejudice a delightful read that resonates across generations.",
    "totalPages": 279,
    "rating": 4.6,
    "category": "Romance",
    "tags": ["Regency Era", "Social Satire", "Family Dynamics"],
    "publisher": "T. Egerton, Whitehall",
    "yearOfPublishing": 1813,
    "price": 150
  },
  {
    "bookId": 5,
    "bookName": "The Catcher in the Rye",
    "author": "J.D. Salinger",
    "image": "https://m.media-amazon.com/images/I/71nXPGovoTL._SL1500_.jpg",
    "review": "The Catcher in the Rye, penned by J.D. Salinger, is a poignant coming-of-age novel that has left an indelible mark on literature. Narrated by the disillusioned teenager Holden Caulfield, the story follows his journey through New York City after being expelled from prep school. As Holden grapples with feelings of alienation and existential angst, he encounters various characters who epitomize the phoniness he despises in society. Salinger's masterful portrayal of teenage angst and his exploration of themes such as innocence, identity, and belonging continue to resonate with readers of all ages.",
    "totalPages": 277,
    "rating": 4.3,
    "category": "Fiction",
    "tags": ["Coming-of-Age", "Alienation", "Identity Crisis"],
    "publisher": "Little, Brown and Company",
    "yearOfPublishing": 1951,
    "price": 260
  },
  {
    "bookId": 6,
    "bookName": "Moby-Dick",
    "author": "Herman Melville",
    "image": "https://m.media-amazon.com/images/I/710K+kF6XfL._SL1500_.jpg",
    "review": "Moby-Dick, written by Herman Melville, is a monumental work of American literature that explores themes of obsession, fate, and the struggle between man and nature. The novel follows the journey of Ishmael, a sailor aboard the whaling ship Pequod, led by the enigmatic Captain Ahab. Ahab's single-minded quest for revenge against the white whale, Moby Dick, drives the crew into the heart of darkness, ultimately leading to their tragic demise. Melville's richly symbolic prose and philosophical reflections on the human condition make Moby-Dick a challenging yet rewarding masterpiece.",
    "totalPages": 635,
    "rating": 4.4,
    "category": "Adventure",
    "tags": ["Whaling", "Symbolism", "Existentialism"],
    "publisher": "Richard Bentley",
    "yearOfPublishing": 1851,
    "price": 250
  },
  {
    "bookId": 7,
    "bookName": "Harry Potter",
    "author": "J.K. Rowling",
    "image": "https://m.media-amazon.com/images/I/819GoteowlL._SL1500_.jpg",
    "review": "Harry Potter and the Philosopher's Stone is the first book in J.K. Rowling's acclaimed fantasy series. It follows the journey of a young wizard, Harry Potter, who discovers his magical heritage on his eleventh birthday and is invited to attend Hogwarts School of Witchcraft and Wizardry. As Harry navigates the challenges of school life, he uncovers the dark secrets of his past and confronts the evil wizard Voldemort. Rowling's captivating storytelling, richly imagined world, and memorable characters have made Harry Potter a beloved classic that appeals to readers of all ages.",
    "totalPages": 309,
    "rating": 4.8,
    "category": "Fantasy",
    "tags": ["Magic", "Friendship", "Adventure"],
    "publisher": "Bloomsbury",
    "yearOfPublishing": 1997,
    "price": 200
  },
  {
    "bookId": 8,
    "bookName": "The Hobbit",
    "author": "J.R.R. Tolkien",
    "image": "https://m.media-amazon.com/images/I/71qJNwA34YL._SL1500_.jpg",
    "review": "The Hobbit, written by J.R.R. Tolkien, is a captivating adventure tale set in the fictional world of Middle-earth. The story follows Bilbo Baggins, a hobbit who is swept away from his comfortable life in the Shire to embark on a perilous journey with a group of dwarves and the wizard Gandalf. Their quest is to reclaim the dwarves' homeland and treasure from the fearsome dragon Smaug. Along the way, Bilbo encounters trolls, elves, goblins, and other fantastical creatures, testing his courage and resourcefulness. Tolkien's masterful storytelling and richly detailed world-building make The Hobbit a timeless classic beloved by readers of all ages.",
    "totalPages": 310,
    "rating": 4.6,
    "category": "Fantasy",
    "tags": ["Adventure", "Quest", "Friendship"],
    "publisher": "George Allen & Unwin",
    "yearOfPublishing": 1937,
    "price": 340
  },
  {
    "bookId": 9,
    "bookName": "Jane Eyre",
    "author": "Charlotte Brontë",
    "image": "https://m.media-amazon.com/images/I/71tpoxBsctL._SL1440_.jpg",
    "review": "Jane Eyre, written by Charlotte Brontë, is a timeless classic that has captivated readers for generations. The novel follows the journey of its titular character, Jane Eyre, from her difficult childhood to her independence as a governess. Set against the backdrop of Victorian England, Jane's story is one of resilience, love, and self-discovery. Her relationship with the brooding Mr. Rochester and the secrets of his estate, Thornfield Hall, form the heart of the narrative, as Jane confronts societal expectations and finds her own path to happiness. Brontë's powerful prose and complex characters make Jane Eyre a compelling and enduring work of literature.",
    "totalPages": 532,
    "rating": 4.5,
    "category": "Classic",
    "tags": ["Victorian Literature", "Romance", "Social Commentary"],
    "publisher": "Smith, Elder & Co.",
    "yearOfPublishing": 1847,
    "price": 120
  },
  {
    "bookId": 10,
    "bookName": "The Alchemist",
    "author": "Paulo Coelho",
    "image": "https://m.media-amazon.com/images/I/71zHDXu1TaL._SL1500_.jpg",
    "review": "The Alchemist by Paulo Coelho is a philosophical novel that follows the journey of Santiago, a young shepherd boy, as he embarks on a quest to fulfill his Personal Legend. Along the way, Santiago encounters a series of characters who impart wisdom and guidance, leading him to discover the true desires of his heart and the meaning of life's journey. Set against the backdrop of the exotic landscapes of Spain, Egypt, and the Sahara Desert, The Alchemist is a timeless tale of self-discovery, destiny, and the pursuit of one's dreams. Coelho's lyrical prose and profound insights make this book a perennial favorite among readers seeking inspiration and enlightenment.",
    "totalPages": 197,
    "rating": 4.3,
    "category": "Fiction",
    "tags": ["Philosophy", "Adventure", "Spirituality"],
    "publisher": "HarperCollins",
    "yearOfPublishing": 1988,
    "price": 380
  }
]
